wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_ipa.h
/* IPA_DLOFF */
#define IPA_DLOFF_DLOFF                   BITS(0,13)                    /*!< destination line offset */

/* IPA_IMS */
#define IPA_IMS_HEIGHT                    BITS(0,15)                    /*!< height of the image to be processed */
#define IPA_IMS_WIDTH                     BITS(16,29)                   /*!< width of the image to be processed */

/* IPA_LM */
#define IPA_LM_LM                         BITS(0,15)                    /*!< line mark */

/* IPA_ITCTL */
#define IPA_ITCTL_ITEN                    BIT(0)                        /*!< inter-timer enable */
#define IPA_ITCTL_NCCI                    BITS(8,15)                    /*!< number of clock cycles interval */

/* IPA_BSCTL */
#define IPA_BSCTL_XSCALE                  BITS(0,13)                    /*!< foreground X scaling factor */
#define IPA_BSCTL_YSCALE                  BITS(16,29)                   /*!< foreground Y scaling factor */

/* IPA_DIMS */
#define IPA_DIMS_DHEIGHT                  BITS(0,15)                    /*!< destination height after scaling */
#define IPA_DIMS_DWIDTH                   BITS(16,29)                   /*!< destination width after scaling */

/* IPA_EF_UV_MADDR */
#define IPA_EF_UV_MADDR_EFUVMADDR         BITS(0,31)                    /*!< foreground even frame/UV memory base address */

/* IPA_CSCC_CFG0 */
#define IPA_CSCC_CFG0_YOFF                BITS(0,8)                     /*!< offset implicit in the Y data */
#define IPA_CSCC_CFG0_UVOFF               BITS(9,17)                    /*!< offset implicit in the UV data */
#define IPA_CSCC_CFG0_C0                  BITS(18,28)                   /*!< Y multiplier coefficient */
#define IPA_CSCC_CFG0_CONVMOD             BIT(31)                       /*!< color space convert mode */

/* IPA_CSCC_CFG1 */
#define IPA_CSCC_CFG1_C4                  BITS(0,10)                    /*!< blue U/Cb multiplier coefficient */
#define IPA_CSCC_CFG1_C1                  BITS(16,26)                   /*!< red V/Cr multiplier coefficient */

/* IPA_CSCC_CFG2 */
#define IPA_CSCC_CFG2_C3                  BITS(0,10)                    /*!< green U/Cb multiplier coefficient */
#define IPA_CSCC_CFG2_C2                  BITS(16,26)                   /*!< green V/Cr multiplier coefficient */

/* constants definitions */
/* IPA foreground parameter struct definitions */
typedef struct {
    uint32_t foreground_memaddr;                          /*!< foreground memory base address */
    uint32_t foreground_lineoff;                          /*!< foreground line offset */
    uint32_t foreground_prealpha;                         /*!< foreground pre-defined alpha value */
    uint32_t foreground_alpha_algorithm;                  /*!< foreground alpha value calculation algorithm */
    uint32_t foreground_pf;                               /*!< foreground pixel format */
    uint32_t foreground_prered;                           /*!< foreground pre-defined red value */
    uint32_t foreground_pregreen;                         /*!< foreground pre-defined green value */
    uint32_t foreground_preblue;                          /*!< foreground pre-defined blue value */
    uint32_t foreground_interlace_mode;                   /*!< foreground input interlace mode enable */
    uint32_t foreground_efuv_memaddr;                     /*!< foreground even frame / UV memory base address */
} ipa_foreground_parameter_struct;

/* IPA background parameter struct definitions */
typedef struct {
    uint32_t background_memaddr;                          /*!< background memory base address */
    uint32_t background_lineoff;                          /*!< background line offset */
    uint32_t background_prealpha;                         /*!< background pre-defined alpha value */
    uint32_t background_alpha_algorithm;                  /*!< background alpha value calculation algorithm */
    uint32_t background_pf;                               /*!< background pixel format */
    uint32_t background_prered;                           /*!< background pre-defined red value */
    uint32_t background_pregreen;                         /*!< background pre-defined green value */
    uint32_t background_preblue;                          /*!< background pre-defined blue value */
} ipa_background_parameter_struct;

/* IPA destination parameter struct definitions */
typedef struct {
    uint32_t destination_memaddr;                         /*!< destination memory base address */
    uint32_t destination_lineoff;                         /*!< destination line offset */
    uint32_t destination_prealpha;                        /*!< destination pre-defined alpha value */
    uint32_t destination_pf;                              /*!< destination pixel format */
    uint32_t destination_prered;                          /*!< destination pre-defined red value */
    uint32_t destination_pregreen;                        /*!< destination pre-defined green value */
    uint32_t destination_preblue;                         /*!< destination pre-defined blue value */
    uint32_t image_width;                                 /*!< width of the image to be processed */
    uint32_t image_height;                                /*!< height of the image to be processed */
    uint32_t image_rotate;                                /*!< angle of image rotation */
    uint32_t image_hor_decimation;                        /*!< image horizontal pre-decimation in width */
    uint32_t image_ver_decimation;                        /*!< image vertical pre-decimation in height */
    uint32_t image_bilinear_xscale;                       /*!< bilinear scaling x factor */
    uint32_t image_bilinear_yscale;                       /*!< bilinear scaling y factor */
    uint32_t image_scaling_width;                         /*!< width of the image after scaling */
    uint32_t image_scaling_height;                        /*!< height of the image after scaling */
} ipa_destination_parameter_struct;

/* destination pixel format */
typedef enum {
    IPA_DPF_ARGB8888 = 0U,                                /*!< destination pixel format ARGB8888 */
    IPA_DPF_RGB888,                                       /*!< destination pixel format RGB888 */
    IPA_DPF_RGB565,                                       /*!< destination pixel format RGB565 */
    IPA_DPF_ARGB1555,                                     /*!< destination pixel format ARGB1555 */
    IPA_DPF_ARGB4444,                                     /*!< destination pixel format ARGB4444 */
    IPA_DPF_BGR888,                                       /*!< destination pixel format BGR888 */
    IPA_DPF_BGR565,                                       /*!< destination pixel format BGR565 */
} ipa_dpf_enum;

